Revit 2026 API

# EffectInstanceSetSpecularColor Method

---

Sets the specular color parameter of the effect instance.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSpecularColor(
	Color color
)
```
```vb
Public Sub SetSpecularColor (
	color As Color
)
```
```cpp
public:
void SetSpecularColor(
	Color^ color
)
```
```fsharp
member SetSpecularColor :
        color : Color -> unit
```

#### Parameters

color Color
     The specular color value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace